# Nir Bahadur Raya March 6, 2023
I found this set of questions on https://pynative.com/python-pandas-exercise/

What included in this Pandas exercise?

It contains 10 questions. The solution is provided for each question.
Each question includes a specific Pandas topic you need to learn.
When you complete each question, you get more familiar with data analysis using pandas.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('Automobile_data.csv')

Exercise 1: From the given dataset print the first and last five rows

In [3]:
data.head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [4]:
data.tail(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

Exercise 2: Clean the dataset and update the CSV file
Replace all column values which contain ?, n.a, or NaN.

In [5]:
#replacing '?' and 'n.a' with NaN
data = data.replace(["?", "n.a"], np.nan)
print(data)

    index      company   body-style  wheel-base  length engine-type  \
0       0  alfa-romero  convertible        88.6   168.8        dohc
1       1  alfa-romero  convertible        88.6   168.8        dohc
2       2  alfa-romero    hatchback        94.5   171.2        ohcv
3       3         audi        sedan        99.8   176.6         ohc
4       4         audi        sedan        99.4   176.6         ohc
..    ...          ...          ...         ...     ...         ...
56     81   volkswagen        sedan        97.3   171.7         ohc
57     82   volkswagen        sedan        97.3   171.7         ohc
58     86   volkswagen        sedan        97.3   171.7         ohc
59     87        volvo        sedan       104.3   188.8         ohc
60     88        volvo        wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
0              four         111               21  13495.0
1              four         111               21  16500.0
2               six         154               19  16500.0
3              four         102               24  13950.0
4              five         115               18  17450.0
..              ...         ...              ...      ...
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

[61 rows x 10 columns]

In [6]:
data.to_csv('updated_automobile.csv',index=False)

Exercise 3: Find the most expensive car company name
Print most expensive car’s company name and price.

In [7]:
data[['company','price']][data.price==data['price'].max()]

          company    price
35  mercedes-benz  45400.0

In [8]:
#alternative way
max_price = data['price'].idxmax()
result = data.loc[[max_price], ['company', 'price']]
print(result)

          company    price
35  mercedes-benz  45400.0

Exercise 4: Print All Toyota Cars details

In [9]:
#printing the details of toyota car
car_manufacturer=data.groupby('company')
toyotaCar=car_manufacturer.get_group('toyota')
print(toyotaCar)

    index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

Exercise 5: Count total cars per company

In [10]:
data['company'].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: company, dtype: int64

In [11]:
#just for practice
engine_type=data.groupby('engine-type')
ohc_engines=engine_type.get_group('ohc')
print(ohc_engines)
print(ohc_engines.shape)

    index        company body-style  wheel-base  length engine-type  \
3       3           audi      sedan        99.8   176.6         ohc
4       4           audi      sedan        99.4   176.6         ohc
5       5           audi      sedan        99.8   177.3         ohc
6       6           audi      wagon       105.8   192.7         ohc
7       9            bmw      sedan       101.2   176.8         ohc
8      10            bmw      sedan       101.2   176.8         ohc
9      11            bmw      sedan       101.2   176.8         ohc
10     13            bmw      sedan       103.5   189.0         ohc
11     14            bmw      sedan       103.5   193.8         ohc
12     15            bmw      sedan       110.0   197.0         ohc
14     17      chevrolet  hatchback        94.5   155.9         ohc
15     18      chevrolet      sedan        94.5   158.8         ohc
16     19          dodge  hatchback        93.7   157.3         ohc
17     20          dodge  hatchback        93.7   157.3         ohc
18     27          honda      wagon        96.5   157.1         ohc
19     28          honda      sedan        96.5   175.4         ohc
20     29          honda      sedan        96.5   169.1         ohc
21     30          isuzu      sedan        94.3   170.7         ohc
22     31          isuzu      sedan        94.5   155.9         ohc
23     32          isuzu      sedan        94.5   155.9         ohc
27     36          mazda  hatchback        93.1   159.1         ohc
28     37          mazda  hatchback        93.1   159.1         ohc
29     38          mazda  hatchback        93.1   159.1         ohc
31     43          mazda      sedan       104.9   175.0         ohc
32     44  mercedes-benz      sedan       110.0   190.9         ohc
33     45  mercedes-benz      wagon       110.0   190.9         ohc
36     49     mitsubishi  hatchback        93.7   157.3         ohc
37     50     mitsubishi  hatchback        93.7   157.3         ohc
38     51     mitsubishi      sedan        96.3   172.4         ohc
39     52     mitsubishi      sedan        96.3   172.4         ohc
40     53         nissan      sedan        94.5   165.3         ohc
41     54         nissan      sedan        94.5   165.3         ohc
42     55         nissan      sedan        94.5   165.3         ohc
43     56         nissan      wagon        94.5   170.2         ohc
48     66         toyota  hatchback        95.7   158.7         ohc
49     67         toyota  hatchback        95.7   158.7         ohc
50     68         toyota  hatchback        95.7   158.7         ohc
51     69         toyota      wagon        95.7   169.7         ohc
52     70         toyota      wagon        95.7   169.7         ohc
53     71         toyota      wagon        95.7   169.7         ohc
55     80     volkswagen      sedan        97.3   171.7         ohc
56     81     volkswagen      sedan        97.3   171.7         ohc
57     82     volkswagen      sedan        97.3   171.7         ohc
58     86     volkswagen      sedan        97.3   171.7         ohc
59     87          volvo      sedan       104.3   188.8         ohc
60     88          volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
3              four         102               24  13950.0
4              five         115               18  17450.0
5              five         110               19  15250.0
6              five         110               19  18920.0
7              four         101               23  16430.0
8              four         101               23  16925.0
9               six         121               21  20970.0
10              six         182               16  30760.0
11              six         182               16  41315.0
12              six         182               15  36880.0
14             four          70               38   6295.0
15             four          70               38   6575.0
16             four          68               31   6377.0
17             four          68               31   6229.0
18             four          76               30   7295.0
19             four         101               24  12945.0
20             four         100               25  10345.0
21             four          78               24   6785.0
22             four          70               38      NaN
23             four          70               38      NaN
27             four          68               30   5195.0
28             four          68               31   6095.0
29             four          68               31   6795.0
31             four          72               31  18344.0
32             five         123               22  25552.0
33             five         123               22  28248.0
36             four          68               37   5389.0
37             four          68               31   6189.0
38             four          88               25   6989.0
39             four          88               25   8189.0
40             four          55               45   7099.0
41             four          69               31   6649.0
42             four          69               31   6849.0
43             four          69               31   7349.0
48             four          62               35   5348.0
49             four          62               31   6338.0
50             four          62               31   6488.0
51             four          62               31   6918.0
52             four          62               27   7898.0
53             four          62               27   8778.0
55             four          52               37   7775.0
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0
(46, 10)

In [12]:
#just for practice
data['engine-type'].value_counts()

ohc      46
dohc      5
ohcv      5
ohcf      2
l         1
rotor     1
dohcv     1
Name: engine-type, dtype: int64

Exercise 6: Find each company’s Higesht price car

In [13]:
every_highest=car_manufacturer['company','price'].max()
print(every_highest)

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

C:\Users\wwwra\AppData\Local\Temp\ipykernel_6116\4007029387.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  every_highest=car_manufacturer['company','price'].max()

Exercise 7: Find the average mileage of each car making company

In [14]:
mileage_avg=car_manufacturer['company','average-mileage'].mean()
print(mileage_avg)

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

C:\Users\wwwra\AppData\Local\Temp\ipykernel_6116\4130975280.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  mileage_avg=car_manufacturer['company','average-mileage'].mean()
C:\Users\wwwra\AppData\Local\Temp\ipykernel_6116\4130975280.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  mileage_avg=car_manufacturer['company','average-mileage'].mean()

Exercise 8: Sort all cars by Price column
Expected Output:

In [15]:
price_col=data.sort_values(by='price', ascending=False)
print(price_col.head())

    index        company   body-style  wheel-base  length engine-type  \
35     47  mercedes-benz      hardtop       112.0   199.2        ohcv
11     14            bmw        sedan       103.5   193.8         ohc
34     46  mercedes-benz        sedan       120.9   208.1        ohcv
46     62        porsche  convertible        89.5   168.9        ohcf
12     15            bmw        sedan       110.0   197.0         ohc

   num-of-cylinders  horsepower  average-mileage    price
35            eight         184               14  45400.0
11              six         182               16  41315.0
34            eight         184               14  40960.0
46              six         207               17  37028.0
12              six         182               15  36880.0

Exercise 9: Concatenate two data frames using the following conditions
Create two data frames using the following two dictionaries.

In [16]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
df=pd.DataFrame(GermanCars)
print(df)

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [17]:
df1=pd.DataFrame(japaneseCars)
print(df1)

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [18]:
df2=pd.concat([df,df1],keys=['German','Japanese'])
print(df2)

                Company   Price
German   0         Ford   23845
         1     Mercedes  171995
         2          BMV  135925
         3         Audi   71400
Japanese 0       Toyota   29995
         1        Honda   23600
         2       Nissan   61500
         3  Mitsubishi    58900

Exercise 10: Merge two data frames using the following condition
Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

In [19]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
df1=pd.DataFrame(Car_Price)
df2=pd.DataFrame(car_Horsepower)
df3=pd.concat([df1,df2],axis=1)
print(df3)

  Company   Price Company  horsepower
0  Toyota   23845  Toyota         141
1   Honda   17995   Honda          80
2     BMV  135925     BMV         182
3    Audi   71400    Audi         160

In [20]:
# to remove the extra company column
df4 = pd.concat([df1, df2['horsepower']], axis=1)
print(df4)

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160